
- dynamic kobieta/1.

kobieta(kasia).
kobieta(eliza).
kobieta(magda).
kobieta(anna).

:- multifile prolog_clause_name/2.


:- dynamic expand_query/4.
:- multifile expand_query/4.


:- dynamic file_search_path/2.
:- multifile file_search_path/2.
file_search_path(library, Dir) :-
    library_directory(Dir).
file_search_path(swi, A) :-
    system:current_prolog_flag(home, A).
file_search_path(swi, A) :-
    system:current_prolog_flag(shared_home, A).
file_search_path(library, app_config(lib)).
file_search_path(library, swi(library)).
file_search_path(library, swi(library/clp)).
file_search_path(library, A) :-
    system:'$ext_library_directory'(A).
file_search_path(foreign, swi(A)) :-
    system:
    (   current_prolog_flag(apple_universal_binary, true),
        A='lib/fat-darwin'
    ).
file_search_path(path, A) :-
    system:
    (   getenv('PATH', B),
        current_prolog_flag(path_sep, C),
        atomic_list_concat(D, C, B),
        '$member'(A, D)
    ).
file_search_path(user_app_data, A) :-
    system:'$xdg_prolog_directory'(data, A).
file_search_path(common_app_data, A) :-
    system:'$xdg_prolog_directory'(common_data, A).
file_search_path(user_app_config, A) :-
    system:'$xdg_prolog_directory'(config, A).
file_search_path(common_app_config, A) :-
    system:'$xdg_prolog_directory'(common_config, A).
file_search_path(app_data, user_app_data('.')).
file_search_path(app_data, common_app_data('.')).
file_search_path(app_config, user_app_config('.')).
file_search_path(app_config, common_app_config('.')).
file_search_path(app_preferences, user_app_config('.')).
file_search_path(user_profile, app_preferences('.')).
file_search_path(app, swi(app)).
file_search_path(app, app_data(app)).
file_search_path(autoload, swi(library)).
file_search_path(autoload, pce(prolog/lib)).
file_search_path(autoload, app_config(lib)).
file_search_path(autoload, Dir) :-
    '$autoload':'$ext_library_directory'(Dir).
file_search_path(pack, app_data(pack)).
file_search_path(library, PackLib) :-
    '$pack':pack_dir(_Name, prolog, PackLib).
file_search_path(foreign, PackLib) :-
    '$pack':pack_dir(_Name, foreign, PackLib).
file_search_path(app, AppDir) :-
    '$pack':pack_dir(_Name, app, AppDir).
file_search_path(pce, PceHome) :-
    link_xpce:
    (   current_prolog_flag(xpce, true),
        pcehome_(PceHome)
    ).
file_search_path(library, pce('prolog/lib')).
file_search_path(foreign, pce(ArchLib)) :-
    link_xpce:
    (   current_prolog_flag(arch, Arch),
        atom_concat('lib/', Arch, ArchLib)
    ).
file_search_path(foreign, swi(ArchLib)) :-
    shlib:
    (   current_prolog_flag(arch, Arch),
        atom_concat('lib/', Arch, ArchLib)
    ).
file_search_path(foreign, swi(SoLib)) :-
    shlib:
    (   (   current_prolog_flag(windows, true)
        ->  SoLib=bin
        ;   SoLib=lib
        )
    ).

go :-
    write('What state do you want to know about?'),
    nl,
    write('Type its name, all lower case, followed by a period.'),
    nl,
    read(State),
    capital_of(State, City),
    write('Its capital is: '),
    write(City),
    nl.
true.

?- 
    system:'$xdg_prolog_directory'(common_config, A).
file_search_path(app_data, user_app_data('.')).
file_search_path(app_data, common_app_data('.')).
|    false.

?- true .

?- true.

?- consult('fam2.pl').
true.

?- kobieta(K), write(K), write(' to kobieta.'), nl.
kasia to kobieta.
K = kasia .

?- kobieta(K), write(K), write(' to kobieta.'), nl, fail.
kasia to kobieta.
eliza to kobieta.
magda to kobieta.
anna to kobieta.
false.

?- kobieta(K), fail.
false.

?- consult('capitals.pl').
Warning: c:/users/vboxuser/desktop/cwiczenia_5_prolog/capitals.pl:13:
Warning:    Redefined static procedure capital_of/2
Warning:    Previously defined at c:/users/vboxuser/desktop/cwiczenia_5_prolog/interac.pl:11
true.

?- capital_of(State, City), write(State), write(' -> '), write(City), nl.
georgia -> atlanta
State = georgia,
City = atlanta .

?- capital_of(State, City), write(State), write(' -> '), write(City), nl, fail.
georgia -> atlanta
california -> sacramento
florida -> tallahassee
maine -> augusta
false.

?- consult('fam2.pl').
true.

?- dynamic(kobieta/1).
true.

?- assert(kobieta(kopernik)).
true.

?- listing(kobieta).
:- dynamic kobieta/1.

kobieta(kasia).
kobieta(eliza).
kobieta(magda).
kobieta(anna).
kobieta(kopernik).

true.

?- kobieta(K), write(K), write(' to kobieta.'), nl, fail.
kasia to kobieta.
eliza to kobieta.
magda to kobieta.
anna to kobieta.
kopernik to kobieta.
false.

?- consult('learner.pl').
true.

?- start.
Warning: c:/users/vboxuser/desktop/cwiczenia_5_prolog/learner_kb.pl:4:
Warning:    Redefined static procedure capital_of/2
Warning:    Previously defined at c:/users/vboxuser/desktop/cwiczenia_5_prolog/capitals.pl:13

Type names entirely in lower case, followed by period.
Type "stop." to quit.

State? georgia.
The capital of georgia is atlanta

State? |: texas.
The capital of texas is austin

State? |: stop.
Saving the knowledge base...
Done.
true .